Revit 2026 API

# AllowedValues Enumeration

---

A range of allowed values.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AllowedValues
```
```vb
Public Enumeration AllowedValues
```
```cpp
public enum class AllowedValues
```
```fsharp
type AllowedValues
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 1 | All values are allowed. |
| NonNegative | 0 | Only non-negative values are allowed. A tolerance of 1.0e-9 is used, so very small negative numbers are accepted. |
| Positive | 2 | Only positive values are allowed. A tolerance of 1.0e-9 is used, so very small positive numbers are rejected. |

#### Reference

Autodesk.Revit.DB Namespace